package com.huwei.neteasemusic.bean.resp;

import com.huwei.neteasemusic.bean.Lrc;

/**
 * @author jerry
 * @date 2016/07/12
 */
public class LrcResp extends ServerTip{


    /**
     * sgc : false
     * sfy : true
     * qfy : false
     * transUser : {"id":26117507,"status":0,"demand":1,"userid":68300495,"nickname":"yuan2323","uptime":1433664743171}
     * lyricUser : {"id":26117507,"status":0,"demand":0,"userid":68300495,"nickname":"yuan2323","uptime":1433660548271}
     * lrc : {"version":14,"lyric":"[00:00.560]私たちの想いが集まれば\n[00:15.060]なんとかなるかも\n[00:18.000]小さなちからだけど\n[00:21.060]育てたい夢がある\n[00:23.930]\n[00:25.750]わからないことだらけ\n[00:29.150]ポケットに地図なんて持ってない\n[00:34.090]少しずつでもいいんだね\n[00:37.220]胸張って進もうよ\n[00:39.780]\n[00:41.090]つまずいたらどうする？\n[00:44.470]\n[00:45.280]笑ってみる？えがおで wai wai wai\n[00:49.280]だいじょうぶ 飾らずに素直な声で\n[00:57.710]one,two,three,four\n[00:58.590]みんなこっちです！\n[01:00.210]\n[01:00.840]Someday いつの日か叶うよ願いが\n[01:08.150]Someday いつの日か届くと信じよう\n[01:16.340]そう泣いてなんかいられないよ だってさ\n[01:22.090]楽しみはまだまだ まだまだこれから！\n[01:26.970]\n[01:35.700]悩みは尽きないのです\n[01:39.140]振り向いて溜め息ついても\n[01:43.830]はげましあえる\n[01:45.830]今日も一緒にいて良かった\n[01:49.830]\n[01:52.510]教えたり教わったり\n[01:55.020]うれしいな なかよし増えてく\n[01:59.260]ケンカになっちゃった時は\n[02:03.070]ペコりますごめんなさい\n[02:06.080]\n[02:07.330]うなずいてよおおきく！\n[02:10.140]\n[02:11.700]笑ってみて！えがおの hi hi hi\n[02:15.390]だいじょうぶ 間違えることもあるけど\n[02:22.080]\n[02:23.390]one,two,three,four\n[02:24.640]やっぱあっちです！\n[02:26.260]\n[02:26.760]Something いま何かあなたの元へと\n[02:34.390]Something いま何かすてきな気持ちを\n[02:42.570]そう伝えたいと思う だから待ってて\n[02:48.140]楽しみがもっともっと\n[02:50.950]もっともっとこれから！\n[02:53.200]\n[02:53.390]これからのSomeday\n[02:54.950]作詞：畑亜貴\n[02:56.390]作曲：yozuca*\n[02:57.330]歌：u's\n[02:58.080]\n[02:58.580]\n[03:16.820]つまずいたらどうする？\n[03:18.880]\n[03:20.510]笑ってみる？えがおで wai wai wai\n[03:24.450]だいじょうぶ 飾らずに素直な声で\n[03:31.140]\n[03:32.510]one,two,three,four\n[03:33.640]みんなこっちです！\n[03:35.260]\n[03:36.770]Someday いつの日か叶うよ願いが\n[03:44.640]Someday いつの日か届くと信じよう\n[03:52.520]そう泣いてなんかいられないよ だってさ\n[03:58.080]楽しみはまだまだ まだまだこれから！\n[04:02.890]\n"}
     * klyric : {"version":0}
     * tlyric : {"version":2,"lyric":"[by:yuan2323]\n[00:00.560]将我们的思念聚集起来的话\n[00:15.060]任何事都能跨过\n[00:18.000]虽然只是微小的力量\n[00:21.060]但有着想成长的梦想\n[00:23.930]不知道的事情非常的多\n[00:25.750]但为什么口袋中没有地图的\n[00:29.150]循序渐进就可以了\n[00:34.090]挺起胸膛前进吧\n[00:37.220]万一跌倒了怎么办？\n[00:39.780]笑一笑吧？笑着说wai wai wai\n[00:41.090]没问题的 用原来的声音呐喊\n[00:44.470]大家来这里吧！\n[00:45.280]有朝一日可以实现愿望\n[00:49.280]相信有朝一日可以传递出去\n[00:57.710]所以不需要哭泣\n[00:58.590]接下来还有更多更多更多更多快乐的事呢！\n[01:00.210]烦恼不完的困扰\n[01:00.840]带着叹息回头望去\n[01:08.150]我会语带鼓励安慰你\n[01:16.340]真庆幸有你在我身旁\n[01:22.090]从实境中彼此学习\n[01:26.970]真开心 感情又更近了一步\n[01:35.700]起争执时相互退让\n[01:39.140]道歉过后和好如初\n[01:43.830]别再郁闷了一起来!\n[01:45.830]做一个 大大的微笑!\n[01:49.830]别在意 有时难免会走错叉路\n[01:52.510]果然还是要往那边!\n[01:55.020]有些事情即将在你周围展开\n[01:59.260]因此感到雀跃不已\n[02:03.070]也想让你体会如此感受 所以请等等\n[02:06.080]从现在起还要创造更多更多\n[02:07.330]更多更多的欢乐!\n[02:10.140]万一跌倒了怎么办？\n[02:11.700]笑一笑吧？笑着说wai wai wai\n[02:15.390]没问题的 用原来的声音呐喊\n[02:22.080]大家来这里吧\n[02:23.390]有朝一日可以实现愿望\n[02:24.640]相信有朝一日可以传递出去\n[02:26.260]所以不需要哭泣\n[02:26.760]接下来还有更多更多更多更多快乐的事呢！\n[02:34.390]\n[02:42.570]\n[02:48.140]\n[02:50.950]\n[02:53.200]\n[02:53.390]\n[02:54.950]\n[02:56.390]\n[02:57.330]\n[02:58.080]\n[02:58.580]\n[03:16.820]\n[03:18.880]\n[03:20.510]\n[03:24.450]\n[03:31.140]\n[03:32.510]\n[03:33.640]\n[03:35.260]\n[03:36.770]\n[03:44.640]\n[03:52.520]\n[03:58.080]\n[04:02.890]"}
     * code : 200
     */

    public boolean sgc;
    public boolean sfy;
    public boolean qfy;
    /**
     * id : 26117507
     * status : 0
     * demand : 1
     * userid : 68300495
     * nickname : yuan2323
     * uptime : 1433664743171
     */

    public TransUser transUser;
    /**
     * id : 26117507
     * status : 0
     * demand : 0
     * userid : 68300495
     * nickname : yuan2323
     * uptime : 1433660548271
     */

    public LyricUser lyricUser;
    /**
     * version : 14
     * lyric : [00:00.560]私たちの想いが集まれば
     [00:15.060]なんとかなるかも
     [00:18.000]小さなちからだけど
     [00:21.060]育てたい夢がある
     [00:23.930]
     [00:25.750]わからないことだらけ
     [00:29.150]ポケットに地図なんて持ってない
     [00:34.090]少しずつでもいいんだね
     [00:37.220]胸張って進もうよ
     [00:39.780]
     [00:41.090]つまずいたらどうする？
     [00:44.470]
     [00:45.280]笑ってみる？えがおで wai wai wai
     [00:49.280]だいじょうぶ 飾らずに素直な声で
     [00:57.710]one,two,three,four
     [00:58.590]みんなこっちです！
     [01:00.210]
     [01:00.840]Someday いつの日か叶うよ願いが
     [01:08.150]Someday いつの日か届くと信じよう
     [01:16.340]そう泣いてなんかいられないよ だってさ
     [01:22.090]楽しみはまだまだ まだまだこれから！
     [01:26.970]
     [01:35.700]悩みは尽きないのです
     [01:39.140]振り向いて溜め息ついても
     [01:43.830]はげましあえる
     [01:45.830]今日も一緒にいて良かった
     [01:49.830]
     [01:52.510]教えたり教わったり
     [01:55.020]うれしいな なかよし増えてく
     [01:59.260]ケンカになっちゃった時は
     [02:03.070]ペコりますごめんなさい
     [02:06.080]
     [02:07.330]うなずいてよおおきく！
     [02:10.140]
     [02:11.700]笑ってみて！えがおの hi hi hi
     [02:15.390]だいじょうぶ 間違えることもあるけど
     [02:22.080]
     [02:23.390]one,two,three,four
     [02:24.640]やっぱあっちです！
     [02:26.260]
     [02:26.760]Something いま何かあなたの元へと
     [02:34.390]Something いま何かすてきな気持ちを
     [02:42.570]そう伝えたいと思う だから待ってて
     [02:48.140]楽しみがもっともっと
     [02:50.950]もっともっとこれから！
     [02:53.200]
     [02:53.390]これからのSomeday
     [02:54.950]作詞：畑亜貴
     [02:56.390]作曲：yozuca*
     [02:57.330]歌：u's
     [02:58.080]
     [02:58.580]
     [03:16.820]つまずいたらどうする？
     [03:18.880]
     [03:20.510]笑ってみる？えがおで wai wai wai
     [03:24.450]だいじょうぶ 飾らずに素直な声で
     [03:31.140]
     [03:32.510]one,two,three,four
     [03:33.640]みんなこっちです！
     [03:35.260]
     [03:36.770]Someday いつの日か叶うよ願いが
     [03:44.640]Someday いつの日か届くと信じよう
     [03:52.520]そう泣いてなんかいられないよ だってさ
     [03:58.080]楽しみはまだまだ まだまだこれから！
     [04:02.890]

     */

    public Lrc lrc;
    /**
     * version : 0
     */

    public Lrc klyric;
    /**
     * version : 2
     * lyric : [by:yuan2323]
     [00:00.560]将我们的思念聚集起来的话
     [00:15.060]任何事都能跨过
     [00:18.000]虽然只是微小的力量
     [00:21.060]但有着想成长的梦想
     [00:23.930]不知道的事情非常的多
     [00:25.750]但为什么口袋中没有地图的
     [00:29.150]循序渐进就可以了
     [00:34.090]挺起胸膛前进吧
     [00:37.220]万一跌倒了怎么办？
     [00:39.780]笑一笑吧？笑着说wai wai wai
     [00:41.090]没问题的 用原来的声音呐喊
     [00:44.470]大家来这里吧！
     [00:45.280]有朝一日可以实现愿望
     [00:49.280]相信有朝一日可以传递出去
     [00:57.710]所以不需要哭泣
     [00:58.590]接下来还有更多更多更多更多快乐的事呢！
     [01:00.210]烦恼不完的困扰
     [01:00.840]带着叹息回头望去
     [01:08.150]我会语带鼓励安慰你
     [01:16.340]真庆幸有你在我身旁
     [01:22.090]从实境中彼此学习
     [01:26.970]真开心 感情又更近了一步
     [01:35.700]起争执时相互退让
     [01:39.140]道歉过后和好如初
     [01:43.830]别再郁闷了一起来!
     [01:45.830]做一个 大大的微笑!
     [01:49.830]别在意 有时难免会走错叉路
     [01:52.510]果然还是要往那边!
     [01:55.020]有些事情即将在你周围展开
     [01:59.260]因此感到雀跃不已
     [02:03.070]也想让你体会如此感受 所以请等等
     [02:06.080]从现在起还要创造更多更多
     [02:07.330]更多更多的欢乐!
     [02:10.140]万一跌倒了怎么办？
     [02:11.700]笑一笑吧？笑着说wai wai wai
     [02:15.390]没问题的 用原来的声音呐喊
     [02:22.080]大家来这里吧
     [02:23.390]有朝一日可以实现愿望
     [02:24.640]相信有朝一日可以传递出去
     [02:26.260]所以不需要哭泣
     [02:26.760]接下来还有更多更多更多更多快乐的事呢！
     [02:34.390]
     [02:42.570]
     [02:48.140]
     [02:50.950]
     [02:53.200]
     [02:53.390]
     [02:54.950]
     [02:56.390]
     [02:57.330]
     [02:58.080]
     [02:58.580]
     [03:16.820]
     [03:18.880]
     [03:20.510]
     [03:24.450]
     [03:31.140]
     [03:32.510]
     [03:33.640]
     [03:35.260]
     [03:36.770]
     [03:44.640]
     [03:52.520]
     [03:58.080]
     [04:02.890]
     */

    public Lrc tlyric;

    public static class TransUser {
        public int id;
        public int status;
        public int demand;
        public int userid;
        public String nickname;
        public long uptime;
    }

    public static class LyricUser {
        public int id;
        public int status;
        public int demand;
        public int userid;
        public String nickname;
        public long uptime;
    }
}
